[
    {
     "title": "FPT University Hanoi students talk with Prof. Rajesh Khajuria",
     "description": "Recently, FPT University Hanoi students had the opportunity to listen to useful sharing of Professor Rajesh Khajuria at 2 workshops: “Future of jobs” and “IT Skills for Global Workforce”.",
     "content": "At the “Future of jobs” workshop, Prof. Rajesh Khajuria gave students the opportunity to explore: the big picture of the change in future jobs; the skills needed to adapt to these changes and challenges in the 4.0 era; competencies to become a global citizen. The venue was full of students excited about the knowledge and experiences that Prof. Rajesh Khajuria shared. The change of the 4.0 revolution, the trend of global technology, the development, and replacement of AI and the software engineering industry, etc. were all discussed and shared. After the workshops, FPT University students got an overview of the current globalization trend, from which they can have their own development orientations as well as have approached a lot of interesting knowledge and useful skills for future self-development.Sourse: FPTU Career Center",
     "img": "https://daihoc.fpt.edu.vn/en/wp-content/uploads/2022/09/Screenshot-2022-09-30-083243-373x206.png",
     "status": true,
     "views": 293,
     "actractive": false,
     "id": "1"
    },
    {
     "title": "Community Project Introducing Vietnamese Traditional Musical Instruments to High School students at FPT University",
     "description": "FPT University and Hanoi Youth Union have implemented the community project introducing Vietnamese traditional musical instruments to high school students to foster and transmit traditional values to the Young. The instruments were first introduced at Truong Dinh and Ly Thuong Kiet high schools in Hanoi.",
     "content": "At FPT University Ho Chi Minh campus Introducing đàn Tỳ Bà – a Vietnamese traditional musical instrument to Nguyen Cong Tru High School’s students and a traditional musical instrument class was opened at the school. Time: April 4th, 2022 (introducing the instrument at the school) July 23rd, 2022 (opening a class). Two classes about Vietnamese traditional musical instruments were opened at Giong Ong To High School in the community project. Time: August 7th, 2022 (The first class) September 11th, 2022 (The second class)",
     "img": "https://daihoc.fpt.edu.vn/en/wp-content/uploads/2022/09/dua-nhac-cu-den-cong-dong-373x206.jpg",
     "status": true,
     "views": 179,
     "actractive": true,
     "id": "2"
    },
    {
     "title": "Member of ACBSP Global Committees shares trends for future work with FPT University HCM students",
     "description": "Prof. Rajesh Khajuria, a member of ACBSP Global Committees, had a meeting and shared trends for future work with students of FPT University in Ho Chi Minh City last week.",
     "content": "Not only possessing the privilege of experiencing an ACBSP-accredited program, but FPT University students also have the opportunity to meet and discuss directly with ACBSP’s mentor, commissioner, and member of Global Committees – Prof. Rajesh Khajuria. During the meeting with the theme Future of Jobs on September 13, Dr. Rajesh Khajuria shared the opportunity to explore future employment trends for students. Prof. Rajesh Khajuria is a member of the Global Committees of ACBSP and an Honorary Professor at FPT University. He was a Former Director at C.K.Shah Vijapurwala Institute of Management, Vadodara and Founder and CEO of TEAM Projects & Consultants. At the meeting, revolving around the topic Future of jobs, Dr. Rajesh Khajuria provided students the opportunity to: Explore the big picture of a future job change; Understand the leading trend of the world labor market; Personal career orientation; Hone the skills you need to become a global citizen.In particular, the Q&A session received enthusiastic responses from the students. Questions and concerns from the audience in turn were answered enthusiastically and thoroughly by Prof. Rajesh Khajuria. Hopefully, todays students have been inspired by a great source of passion and are ready to equip themselves with the necessary skills for the future.️ The next meeting with Prof. Rajesh Khajuria with the theme IT Skills for Work will take place from 9:30-12:00 on September 14, 2022, at the Library Hall, FPT University Ho Chi Minh City. Source: https://daihoc.fpt.edu.vn/uy-vien-hoi-dong-kiem-dinh-acbsp-chia-se-xu-the-lam-viec-tuong-lai-voi-sv-dh-fpt/?fbclid=IwAR1DE03apRvH3YkYidv1peqjXi68T5acOt7kMkOCeIk0u7JoHx5NFGNZknQ",
     "img": "https://daihoc.fpt.edu.vn/en/wp-content/uploads/2022/09/dai_hoc_fpt_2-1663571460-768x512-1-373x206.jpeg",
     "status": true,
     "views": 332,
     "actractive": true,
     "id": "3"
    },
    {
     "title": "FPT University students learn about Blockchain with an Indian expert",
     "description": "On the morning of September 15, students of FPT University Hanoi had the opportunity to meet and discuss with Mr. Chitrang Modi, expert from Earnfinex, an Indian financial technology company, on the topic of Blockchain and Entrepreneurship.",
     "content": "The seminar was organized by the CF Department with the attendance of Mr. Tran Quy Ban, Mr. Ngo Tung Son, and more than 30 IT students at the Innovation Lab of FPT University Hanoi. Mr. Chitrang Modi from Earnfinex, an Indian Fintech – Blockchain company. The topic revolved around Blockchain technology and applications of Blockchain in the field of banking and finance.Earnfinex is an Indian global financial technology services company. Its main products include: earnfinex.com, earnfinex.online, earnfinex.org, earnfinex.net, and earnfinex.app. These products range from automated trading by bots, blockchain platforms for finance to the metaverse. During the seminar, Mr. Chitrang Modi shared about Blockchain technology in depth and opportunities to work in this field for FPT University students. As an expert in the field of Digital Marketing, Fintech, and Blockchain as well as incubating startups, he evaluated that there are a bunch of opportunities for Vietnamese students. Currently, technology products in Vietnam are still lacking in overall. Many problems can be solved using technology in general and especially blockchain. Some applications are quite popular in India but are currently unavailable in Vietnam. The current Vietnamese technology market is quite similar to India’s ten years ago with many potential opportunities for programmers to exploit. The Indian expert affirmed that if any technology product reaches 10,000 subscribers, he can fully support raising capital from investment funds. Mr. Chitrang Modi suggested setting up an incubator for startup projects of FPT University students at Hoa Lac campus to exploit students’ strengths in application programming and cooperate in providing consulting on start-ups. If the project has high quality, it can ultimately turn into a promising technology startup. Nguyen Cong Khoa (second-year student, FPT University Hanoi campus) attended the seminar and shared that he gained new knowledge and understanding of Blockchain. “The information and knowledge gained from today’s seminar can help me apply it to my current courses and working projects. I think this can also become a foundation for me to be more confident when starting to work with businesses in the future,” Khoa shared. The representative of FPTU Innovation Lab exchanged souvenirs with Mr. Chitrang Modi after a meaningful discussion with students. In addition, when visiting the facilities at the Hanoi campus, Mr. Modi was very impressed with the infrastructure, scale, and educational philosophy at FPT University. He also hopes that in the future, when he returns to Vietnam, he can participate in more quality and more profound cooperation programs with lecturers and students of FPT University.",
     "img": "https://daihoc.fpt.edu.vn/en/wp-content/uploads/2022/09/talk-blockchain-2png-1663561012-373x206.png",
     "status": true,
     "views": 215,
     "actractive": true,
     "id": "4"
    },
    {
     "title": "Successful AQAS workshop at FPT University",
     "description": "On August 22nd, 2022, AQAS conducted an online workshop at FPT University (FPTU) as part of an international accreditation procedure. This is the first collaboration between AQAS and FPTU to do the evaluation of training programs.",
     "content": "AQAS is a non-profit organization registered under German law and recognized by all relevant international networks/associations. AQAS is one of the most experienced accreditation agencies in Germany. Until now, they accredited 7,400 programs and expertise across all disciplines. Moreover, AQAS is allowed to evaluate and recognize higher education institutions and training programs at all levels in line with Vietnam’s regulations.On August 22nd, 2022, AQAS organized an online workshop at FPTU to introduce the organization as well as the evaluation criteria. The workshop was attended by Dr. Ronny Heintze (Deputy Director of AQAS Commissioner for international projects), Dr. Vi Le (AQAS consultant), Dr. Nguyen Kim Anh (Vice Rector of FPTU), and nearly twenty experts and staff from FPTU. As Professor Nguyen Kim Anh emphasized: “FPTU is excited to cooperate with AQAS to evaluate our training programs. We look forward to celebrating the membership in an appropriate ceremony with AQAS in the future”. The workshop is absolutely helpful to provide detailed and clear information about program accreditation criteria, procedures, and special requirements for all FPTU’s academics. FPTU looks forward to further collaboration to share experiences with the experienced AQAS accreditation organization in the future.",
     "img": "https://daihoc.fpt.edu.vn/en/wp-content/uploads/2022/09/ff7b9dc927f3e2adbbe2-373x206.jpg",
     "status": true,
     "views": 163,
     "actractive": true,
     "id": "5"
    },
    {
     "title": "Introduction to “Sustainable Development Goals”: Are FPT Education people aiming for “sustainable development”?",
     "description": "When we have heard about “sustainable development”, we think its concept is very academic and macro. It is, however, as close as the activities that FPT Education people still do on a daily basis.",
     "content": "Interpreting the theme “Sustainable Development. The most common definition of “Sustainable Development” is a development in all aspects of the society in the present as well as in the future”. To accomplish so, an individual or organization must prioritize three factors including economy, society, and ecology in a balanced manner. The United Nations has outlined 17 sustainable development goals below to further explain this concept: To end poverty in all its forms everywhere. Conserve and sustainably use the oceans, seas, and marine resources for sustainable development. Protect, restore and promote sustainable use of terrestrial ecosystems, sustainably manage forests, combat desertification, and halt and reverse land degradation and halt biodiversity loss. Promote just, peaceful and inclusive societies  Revitalize the global partnership for sustainable development  FPT Education people aim for “sustainable development” every day. Each FPT Edu person is still contributing to the economy, society, and the ecosystem every day through their work at the organization, their habits, and activities in daily life instead of thinking of doing the “big word” or influencing more or fewer others. Let’s take a look at a few common activities to which FPT Edu employees from various departments, divisions, and regions have contributed significantly. The department of Student Affairs as well as the International Cooperation and Personal Development Program, and members of Soft Skill Subject have organized a number of talk shows, debates, seminars, and small/large-scale contests to help FPT Edu’s students gain a better understanding of ecological concerns (energy sources, biology, climate change, etc.) and social issues (gender equality, welfare, etc.). They are in charge of ensuring students’ mental health by providing “unique” psychological counseling services at FPT Edu..",
     "img": "https://daihoc.fpt.edu.vn/en/wp-content/uploads/2022/08/279458421_3130764007145743_8954462282073093044_n-373x206.jpg",
     "status": true,
     "views": 114,
     "actractive": true,
     "id": "6"
    },
    {
     "title": "Take a look at the sustainable development activities of FPT Edu-er",
     "description": "FPT Education students and staff across the nation have done several activities and made positive contributions to the community, economy, society, and ecosystem on a daily basis. Let’s take a look at three activities that are attracting FPT Education staff and students’ attention.",
     "content": "The “Business hours” is a series of career-oriented activities, which helps students improve their skills as well as connect with enterprises and job opportunities. Students will have the opportunity to explore a variety of topics throughout each course, including professional knowledge and essential soft skills in the industry. During the “Business hours”, speakers who are representatives of companies of all sizes and sectors let students participate in “monopoly” talks and discuss “unwritten law” in the workplace. Therefore, students could gain a better understanding of organizational culture. FPT International Training Institute has helped businesses and students connect and understand each other by organizing and maintaining the “Business hours” as a regular activity, especially during the COVID-19 pandemic. This is not only an opportunity to speed up the job search process for students even before graduation but also provided businesses with well-trained human resources. In general, this activity is contributing to promoting sustainable development for society by offering quality jobs and opportunities for youth force Vietnam (SDG8). FPT Da Nang Primary & Secondary School recently held a “Frogs” Mental Health Workshop for 6th, 7th, and 8th graders, with the purpose of teaching them how to manage their emotions through an online counseling program. In the workshop, “Com Frogs” learned to define, categorize, and deal with negative emotions, as well as access fundamental relaxation techniques and open up to share their own thoughts. Health care and mental health care for students are common activities at FPT Edu from elementary to university in order to “ensure a healthy life and well-being for all ages” (SGD 3). In June 2020, FPT Education launched the Post-a-tree campaign to convey the message of green living to the general public. The campaign has attracted 444 employees and students of FPT Education, resulting in planting more than 148 trees, thanks to the rule “with 3 images taken with trees posted on Facebook with the hashtag of the campaign, we will help you plant a tree and make the Earth greener”. In August 2020, FPT Edu continued the “Ke hoach nho” project, which appreciates simple but significant activities of FPT Edu employees and students for protecting the environment, such as reducing plastic bags, planting, and caring for trees, saving energy, and so on. FPT Edu hopes that this campaign will contribute to promoting sustainable consumption (SDG 12), Take urgent action to combat climate change and its impacts (SDG 13), conserve and sustainably use the oceans, seas, and marine resources for sustainable development (SDG 14), and protect, restore, and promote the sustainable use of terrestrial ecosystems (SDG 15). The “Ke hoach nho” project is part of a series of public relations activities focused on sustainable development in FPT Education. Employees and students can access the link here to participate in the campaign.",
     "img": "https://daihoc.fpt.edu.vn/en/wp-content/uploads/2022/08/279458421_3130764007145743_8954462282073093044_n-373x206.jpg",
     "status": true,
     "views": 213,
     "actractive": true,
     "id": "7"
    },
    {
     "title": "Strategies for Teaching Speaking Skills – Seminar for FPT Education’s faculty members",
     "description": "On August 16, the seminar “Strategies for Teaching Speaking Skills” will be held at FPT Polytechnic, Hanoi with the participation of Dr. Roselind Wan, from Universiti Teknologi PETRONAS (UTP).",
     "content": "The Office of Science Management and International Affairs (SMIA), FPT University, and FPT Polytechnic Hanoi co-organize the seminar “Strategies for Teaching Speaking Skills.” Faculty from FPT Education and Dr. Roselind Wan from Universiti Teknologi PETRONAS (UTP) participated in the session and shared their knowledge. With the topic “Strategies for Teaching Speaking Skills,” Dr. Roselind Wan will share effective methods for teaching English in Malaysia. She will also discuss universal design principles for speaking activities. The program promises to bring valuable shares from the speakers, contributing to raising awareness of the importance of proper and appropriate strategies in teaching English. In addition, lecturers from FPT Polytechnic, FPT University, and other units of FPT Education will also have the opportunity to share and discuss challenges and solutions in teaching speaking skills. Ms. Roselind will bring to the curriculum, in particular, the best practices for designing speaking exercises that are used at Universiti Teknologi PETRONAS. It is hoped that the seminar will bring together Dr. Roselind Wan and lecturers from the education sector to exchange teaching English speaking skills strategies and promote and enhance the quality of teaching and learning. Original post: https://caodang.fpt.edu.vn/tin-tuc-poly/ha-noi-tin-sinh-vien/fpt-polytechnic-ha-noi-to-chuc-hoi-thao-strategies-for-teaching-speaking-skills.html ",
     "img": "https://daihoc.fpt.edu.vn/en/wp-content/uploads/2022/09/utp-768x541-1-373x206.jpg",
     "status": true,
     "views": 117,
     "actractive": false,
     "id": "8"
    },
    {
     "title": "FPT Education Global to Successfully Carry Out Faculty Exchange Program with IIB Darmajaya in Data Science",
     "description": "On July 12, 2022, in collaboration with the Office of Science Management and International Affairs, FPT University, FPT Education Global (FEG) successfully carried out a remote short-term FE lecturer exchange program (Faculty Exchange program) with Informatics & Business Institute Darmajaya (IIB Darmajaya) in the field of Natural Language Processing in Data Science.",
     "content": "Natural Language Processing in Data Science is considered one of the most difficult majors in the field of artificial intelligence. Also, Natural Language Processing (NLP) plays a crucial role in enterprise solutions that streamline business processes, boost employee productivity and especially simplify critical business processes.The lecture attracted more than 100 Indonesian students from IIB Darmajaya under the guidance of Mr. Tran Quy Ban from FPT University Vietnam. With his in-depth experience and expertise in data science and information systems, Mr. Tran Quy Ban has provided students with a deeper understanding of this unique sector. At the same time, by attending this lecture, students had a chance to exchange, and gain more knowledge in order to conquer the rich data science environment. In addition, lecturer Tran Quy Ban shared helpful information such as dense layer, Recurrent neural network – RNN, transformer, or scaled dot-product attention. Meanwhile, applications of natural language processing are seen to be the fundamental knowledge. This knowledge and skills can partly assist students in building an effective direction, gaining more experience, and preparing for the long-term transition into the new era of artificial intelligence (AI) in the future. A remote short-term FE lecturer exchange program (Faculty Exchange Program) provides FPT University with a fantastic chance to deepen the relationship with IIB Darmajaya. By the way, this is a brand-new opportunity for FPT lecturers to work, do research, and teach in a professional, international setting while also honing their creative and research topic abilities. More importantly, by sharing different cultures and environments, academic units participating in this faculty exchange program can learn more about their partners. Besides, thanks to the existing strong human resources, FPT University in general and FPT Education Global in particular and IIB Darmajaya will be able to develop more fruitful collaboration activities in the future and the ability to construct and establish long-term international contacts. ",
     "img": "https://daihoc.fpt.edu.vn/en/wp-content/uploads/2022/09/069e6ebf63e4a7bafef5-373x206.jpg",
     "status": true,
     "views": 213,
     "actractive": true,
     "id": "9"
    },
    {
     "title": "First Offline Study Tour Summer 2022 Post COVID-19 – What an Incredible Experience at FPT Education Global!",
     "description": "The Study Tour Summer 2022 with FPT Education Global at FPT University Danang was successfully completed by the participation of international students from Universiti Teknologi PETRONAS (UTP) between June 13th – 20th, 2022.",
     "content": "The student experience journey, which arrived in Da Nang on June 13th, will feature a number of fantastic events, including The Student Leadership Summit with FPT University students, Innovate The Future by STEM for students at FPT School, and English Language Program (UPEng) with children from Hope School. Additionally, with the enthusiastic support of FPT students, Malaysian students got the chance to learn about various aspects of Vietnamese culture through the FPT Software visit, Danang City Tour, and Culture Exchange. “I gained a lot of wonderful experience throughout this program. I made new Vietnamese friends, toured the cities, learned new Vietnamese words and phrases, and had fun. I like the bond I shared with my coordinator, Ms. My as well as the buddies. I also like the activities that were planned for us and how well the schedule worked for all of us.” – Low Yi Xun from Universiti Teknologi PETRONAS (UTP) shared. Especially, Soviinthiran Kuruparam, a Malaysian student from Universiti Teknologi PETRONAS (UTP), expressed his impression on the outdoor exchange known as the English Language Program (UPEng) in Hope School that he had a chance to help children in especially difficult circumstances. “I gained memorable experiences with new friends and exposure to a new culture and lifestyle in Vietnam. I loved the participation from both FPT Students and also Hope School students and how my team and I were able to cater to both students. I love that we were given the chance to put smiles on the faces of the Hope School students and somehow take their problems away, even if it was for one night. Moreover, there were no difficulties as our buddies were perfect in helping us throughout the program.” – Soviinthiran A/L Kuruparam from Universiti Teknologi PETRONAS (UTP) shared. Study Tour Summer 2022 is one of many study abroad programs which is organized annually by FPT Education Global for international students from FPT’s partner institutions. The program gives participants an opportunity to engage with the socio-cultural realities of Vietnam, allowing foreign students to learn a great deal, gain valuable experiences as well as expand their networking.Currently, FPT Education Global is accepting applications for Study Tour Summer 2022. Visit our website for additional details!",
     "img": "https://daihoc.fpt.edu.vn/en/wp-content/uploads/2022/09/63365cc153a497faceb5-373x206.jpg",
     "status": true,
     "views": 324,
     "actractive": true,
     "id": "10"
    }
   ]